Services/src/Catalogs/С_Сервисы/С_Сервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>С_Сервисы</name>
  <predefined>
    <items>
      <name>All</name>
      <description>All</description>
    </items>
    <items>
      <name>CurrClassifier</name>
      <description>Curr classifier</description>
    </items>
    <items>
      <name>DirectBank</name>
      <description>Direct bank</description>
    </items>
    <items>
      <name>AddressClassifier</name>
      <description>Адресный классификатор</description>
    </items>
    <items>
      <name>Bankrupt</name>
      <description>Банкроты</description>
    </items>
    <items>
      <name>Blanks</name>
      <description>БСО</description>
    </items>
    <items>
      <name>Map</name>
      <description>Карты</description>
    </items>
    <items>
      <name>BanksClassifier</name>
      <description>Классификатор банков</description>
    </items>
    <items>
      <name>CurrRates</name>
      <description>Курсы валют</description>
    </items>
    <items>
      <name>ITS</name>
      <description>Не пройдена проверка ИТС</description>
    </items>
    <items>
      <name>OffContractors</name>
      <description>Реестр предприятий с повышенным риском совершения</description>
    </items>
    <items>
      <name>OrgInfo</name>
      <description>Свободный реестр (организация)</description>
    </items>
    <items>
      <name>KontrInfo</name>
      <description>Свободный реестр ЮЛ</description>
    </items>
    <items>
      <name>Einvoices</name>
      <description>ЭСЧФ</description>
    </items>
  </predefined>
  <attributes>
    <name>БесплатныйСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Services/src/HTTPServices/KontrInfo/Module.bsl
Функция KontrInfoOST(Запрос)
		
	Отказ = Ложь;
	КодОшибки = "";
	Ответ = Новый HTTPСервисОтвет(200);	
	
	СтруктураПараметров = С_СлужебныеПроцедурыФункцииСервер.РазобратьВходныеданные(Запрос);
	
	С_РаботаССервисамиСлужебный.ПроверитьОбщийДоступКСервисам(СтруктураПараметров,  Ответ, КодОшибки, Отказ);

	Если Отказ Тогда
		Возврат Ответ
	КонецЕсли;
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.KontrInfo, КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ
	КонецЕсли;
									
	ДвоичныеДанные = ПолучитьДанныеСервиса(СтруктураПараметров, Ответ,  КодОшибки, Отказ);
	
	Если Отказ Тогда
		С_СлужебныеПроцедурыФункцииСервер.УстановитьКодОшибки(Ответ, КодОшибки);
		Возврат Ответ; 
	КонецЕсли;	

	//Ответ.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);							
	Возврат Ответ;	

КонецФункции

Функция ПолучитьДанныеСервиса(СтруктураПараметров, Ответ, КодОшибки, Отказ)
	
	ВерсииКонтактов = Неопределено;
	ВерсииБанковскихСчетов = Неопределено;
	ВерсииКонтактнойИнформации  = Неопределено;

	
	Если  СтруктураПараметров.Свойство("ID_CONTR_UNP_BANK") Тогда
		ВерсииБанковскихСчетов = СокрЛП(СтруктураПараметров.ID_CONTR_UNP_BANK); 
	КонецЕсли;
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.BanksClassifier, КодОшибки, Отказ);
	СтруктураПараметров.Вставить("ИспользоватьБанки", ?(Отказ, Ложь, Истина));
	
	С_РаботаССервисамиСлужебный.ЗарегистрироватьИспользованиеСервиса(СтруктураПараметров, Справочники.С_Сервисы.AddressClassifier, КодОшибки, Отказ);	
	СтруктураПараметров.Вставить("ИспользоватьАдресный", ?(Отказ, Ложь, Истина));

	
	Если  СтруктураПараметров.Свойство("ID_CONTR_UNP_KONTI") Тогда
		ВерсииБанковскихСчетов = СокрЛП(СтруктураПараметров.ID_CONTR_UNP_KONTI); 
	КонецЕсли;
 		
	Если  СтруктураПараметров.Свойство("ID_CONTR_UNP_KONT")  Тогда
		ВерсииКонтактов = СокрЛП(СтруктураПараметров.ID_CONTR_UNP_KONT); 	
	КонецЕсли;

	Отказ = Ложь;
	ТекстОшибки = "";
	С_СвободныйРеестрСервер.СформироватьXMLКонтрагента(СтруктураПараметров, Ответ, ТекстОшибки, Отказ);
		
	Если ВерсииБанковскихСчетов <> Неопределено ИЛИ  ВерсииКонтактнойИнформации <> Неопределено ИЛИ ВерсииКонтактов <> Неопределено Тогда
		С_СвободныйРеестрСервер.СформироватьXMLПоОбновлениям(ВерсииКонтактов, ВерсииКонтактнойИнформации, ВерсииБанковскихСчетов, СтруктураПараметров, Ответ, ТекстОшибки, Отказ);
	КонецЕсли;	
		
	Возврат Ответ;
		
КонецФункции
